/*출처: https://data.kric.go.kr/rips/M_01_01/detail.do?id=32 */

var line2pos = [
  {
    "역사명": "감삼",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.8543251,
    "역경도": 128.5439011
  },
  {
    "역사명": "강창",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.8531116,
    "역경도": 128.4789997
  },
  {
    "역사명": "경대병원",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.863302,
    "역경도": 128.60336
  },
  {
    "역사명": "계명대",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.85146491,
    "역경도": 128.491969
  },
  {
    "역사명": "고산",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.84,
    "역경도": 128.69
  },
  {
    "역사명": "내당",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.860194,
    "역경도": 128.564593
  },
  {
    "역사명": "다사",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.86495301,
    "역경도": 128.4582876
  },
  {
    "역사명": "담티(수성대·대륜)",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.85,
    "역경도": 128.65
  },
  {
    "역사명": "대구은행(대구교육청)",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.85996896,
    "역경도": 128.6137597
  },
  {
    "역사명": "대실",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.8573333,
    "역경도": 128.4656264
  },
  {
    "역사명": "두류",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.8572405,
    "역경도": 128.551509
  },
  {
    "역사명": "만촌",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.85,
    "역경도": 128.64
  },
  {
    "역사명": "문양",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.86414313,
    "역경도": 128.4370043
  },
  {
    "역사명": "반고개",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.8623,
    "역경도": 128.5691714
  },
  {
    "역사명": "반월당",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.864592,
    "역경도": 128.593334
  },
  {
    "역사명": "범어",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.8591,
    "역경도": 128.6257
  },
  {
    "역사명": "사월",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.836566,
    "역경도": 128.715173
  },
  {
    "역사명": "성서산업단지",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.8518236,
    "역경도": 128.5021662
  },
  {
    "역사명": "수성구청(KBS)",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.85874022,
    "역경도": 128.6359517
  },
  {
    "역사명": "수성알파시티(삼성라이온즈파크)",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.85,
    "역경도": 128.67
  },
  {
    "역사명": "신매",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.84,
    "역경도": 128.7
  },
  {
    "역사명": "연호",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.85,
    "역경도": 128.67
  },
  {
    "역사명": "영남대",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.836373,
    "역경도": 128.752966
  },
  {
    "역사명": "용산(서부법원?검찰청입구)",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.8142587,
    "역경도": 128.5407738
  },
  {
    "역사명": "이곡",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.85062003,
    "역경도": 128.5157686
  },
  {
    "역사명": "임당",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.834131,
    "역경도": 128.741076
  },
  {
    "역사명": "정평",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.83407,
    "역경도": 128.728695
  },
  {
    "역사명": "죽전",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.85057553,
    "역경도": 128.5369391
  },
  {
    "역사명": "청라언덕",
    "노선명": "대구 도시철도 2호선",
    "역위도": 35.8650508,
    "역경도": 128.5787271
  }
]