/*출처: https://data.kric.go.kr/rips/M_01_01/detail.do?id=32 */

var line3pos = [
  {
    "역사명": "건들바위",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.85538252,
    "역경도": 128.5996903
  },
  {
    "역사명": "공단",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.891,
    "역경도": 128.553
  },
  {
    "역사명": "구암(과학대보건대입구)",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.92574223,
    "역경도": 128.5503415
  },
  {
    "역사명": "남산(계명네거리)",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.85668979,
    "역경도": 128.5834576
  },
  {
    "역사명": "달성공원",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.87703001,
    "역경도": 128.5821218
  },
  {
    "역사명": "대봉교",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.85499783,
    "역경도": 128.6063685
  },
  {
    "역사명": "동천",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.93770658,
    "역경도": 128.556683
  },
  {
    "역사명": "만평",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.889893,
    "역경도": 128.561002
  },
  {
    "역사명": "매천",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.912,
    "역경도": 128.543
  },
  {
    "역사명": "매천시장",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.904,
    "역경도": 128.545
  },
  {
    "역사명": "명덕(2·28민주운동기념회관)",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.85694518,
    "역경도": 128.5900469
  },
  {
    "역사명": "범물",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.82083917,
    "역경도": 128.6401127
  },
  {
    "역사명": "북구청(DGB대구은행파크)",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.88481395,
    "역경도": 128.5814483
  },
  {
    "역사명": "서문시장(동산병원)",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.86966429,
    "역경도": 128.582241
  },
  {
    "역사명": "수성구민운동장",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.85240979,
    "역경도": 128.6251246
  },
  {
    "역사명": "수성못(TBC)",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.83135605,
    "역경도": 128.6232167
  },
  {
    "역사명": "수성시장",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.85431676,
    "역경도": 128.6160292
  },
  {
    "역사명": "어린이세상",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.84516989,
    "역경도": 128.6244677
  },
  {
    "역사명": "용지",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.8182678,
    "역경도": 128.6465345
  },
  {
    "역사명": "원대",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.88973679,
    "역경도": 128.5743923
  },
  {
    "역사명": "지산",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.82515322,
    "역경도": 128.6319513
  },
  {
    "역사명": "청라언덕(신남)",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.86419437,
    "역경도": 128.5823758
  },
  {
    "역사명": "칠곡경대병원",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.95838748,
    "역경도": 128.5598908
  },
  {
    "역사명": "칠곡운암",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.93145534,
    "역경도": 128.5545305
  },
  {
    "역사명": "태전",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.919,
    "역경도": 128.547
  },
  {
    "역사명": "팔거(국립농관원통계청)",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.94404716,
    "역경도": 128.5583366
  },
  {
    "역사명": "팔달",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.897,
    "역경도": 128.546
  },
  {
    "역사명": "팔달시장",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.88883085,
    "역경도": 128.5678716
  },
  {
    "역사명": "학정",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.95155512,
    "역경도": 128.5591934
  },
  {
    "역사명": "황금",
    "노선명": "대구 도시철도 3호선",
    "역위도": 35.83907838,
    "역경도": 128.6239185
  }
]